-- MySQL dump 10.13  Distrib 8.0.46, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: jejuro
-- ------------------------------------------------------
-- Server version	8.0.46

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `poi_source_map`
--

DROP TABLE IF EXISTS `poi_source_map`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `poi_source_map` (
  `source_poi_id` varchar(255) NOT NULL,
  `poi_id` bigint unsigned NOT NULL,
  PRIMARY KEY (`source_poi_id`),
  KEY `ix_poi_source_map_poi` (`poi_id`),
  CONSTRAINT `fk_poi_source_map_poi` FOREIGN KEY (`poi_id`) REFERENCES `poi` (`poi_id`) ON DELETE CASCADE ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='외부 관광지 ID와 서비스 POI 매핑';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `poi_source_map`
--

LOCK TABLES `poi_source_map` WRITE;
/*!40000 ALTER TABLE `poi_source_map` DISABLE KEYS */;
INSERT INTO `poi_source_map` VALUES ('정방폭포',2),('제주4.3평화공원',3),('제주시민속오일시장',4),('성산일출봉',5),('섭지코지',6),('포도뮤지엄',8),('제주코코몽에코파크',9),('카멜리아힐',10),('ICC제주국제컨벤션센터',12),('협재해수욕장',13),('표선해수욕장',14),('붉은오름자연휴양림',15),('헬로키티아일랜드',18),('고성오일시장',19),('오설록티뮤지엄',20),('신화테마파크',22),('수목원테마파크',24),('항파두리 항몽유적지',25),('천지연폭포',26),('에코랜드테마파크',29),('곽지해수욕장',30),('중문색달해수욕장',31),('바이나흐튼 크리스마스박물관',32),('제주동문시장',34),('더마파크',35),('상효원수목원',37),('이호테우해수욕장',38),('세화해변',39),('만장굴',40),('보롬왓',42),('성이시돌목장',44),('한라수목원',45),('스카이워터쇼',46),('한림공원',47),('외돌개',48),('용연구름다리',49),('산방산탄산온천',52),('서귀포항',54),('서복전시관',56),('본태박물관',59),('제주 세계자연유산센터',64),('이중섭미술관',67),('감귤박물관',68),('절물자연휴양림',69),('9.81파크',71),('화순금모래해수욕장',73),('바이제주',74),('피규어뮤지엄제주',76),('해녀박물관',79),('세계자동차&피아노박물관',80),('아라리오뮤지엄 탑동시네마',81),('세화민속오일시장',84),('여미지식물원',85),('서귀포유람선',88),('환상숲곶자왈공원',89),('산굼부리',99),('건강과성박물관',102),('제주민속촌',103),('점보빌리지',105),('제주특별자치도 민속자연사박물관',106),('오늘은녹차한잔',109),('제주라프',110),('관음사',112),('사라봉',114),('제주레포츠랜드',115),('휴애리자연생활공원',116),('이중섭거리',120),('우도',121),('김녕미로공원',122),('서귀포향토오일시장',125),('거문오름',126),('신산공원',128),('약천사',131),('렛츠런파크제주',139),('세리월드',142),('금오름',144),('김영갑갤러리두모악',145),('제주항공우주박물관',147),('별방진',154),('제주아트서커스',158),('비양도망대',159),('선녀와나무꾼 테마공원',162),('혼인지',165),('소정방폭포',168),('아끈다랑쉬오름',171),('테디베어뮤지엄 제주점',174),('해변산책',179),('수월봉전망대',183),('송악산둘레길',185),('서귀포칠십리시공원',186),('대한불교조계종천왕사',194),('서귀포예술의전당',196),('삼다수숲길',200),('물영아리',202),('제주허브동산',203),('제주동문재래야시장',207),('한라생태숲',209),('드르쿰다in성산',210),('서문공설시장',212),('새별오름',217),('산방산',222),('함덕해수욕장',225),('제주목 관아',226),('삼무공원',229),('김녕해수욕장',233),('노형수퍼마켙',234),('이마트 서귀포점',237),('쇠소깍',241),('제주도립김창열미술관',252),('아르떼뮤지엄 제주',261),('수산봉',267),('도두봉',268),('어영공원',272),('제주불빛정원',273),('서귀포치유의숲',274),('한라산국립공원',277),('중문대포주상절리대',281),('따라비오름',283),('신양섭지해수욕장',287),('서귀포매일올레시장',290),('뽀로로앤타요테마파크 제주',303),('서우봉 산책로',309),('스누피가든',317),('쇠소깍관광지',318),('사려니숲길 붉은오름 입구',326),('한라산국립공원 영실탐방로',328),('메이즈랜드',332),('제주현대미술관',336),('국립제주박물관',340),('산물관광농원',352),('제주동문재래시장',361),('수목원길야시장',362),('마방목지',371),('이호테우등대',372),('쇠머리오름',383),('한라산아래첫마을',386),('월정리해수욕장',398),('금능해수욕장',399),('비양도',400),('평대리해수욕장',401),('삼양해수욕장',402),('한라산국립공원 관음사탐방로',403),('원앙폭포',404),('소천지',405),('청굴물',406),('용두암',407),('도두동무지개해안도로',408),('백약이오름',409),('돌염전',410),('올레길 7코스(서귀포-월평 올레)',411),('검멀레해변',412),('산양큰엉곶',413),('광치기해변',414),('비자림',415),('월령선인장군락지',416),('천제연폭포',417),('자구리문화예술공원',418),('문도지오름',419),('제주성읍마을',420),('황우지선녀탕',421),('올레길 16코스(고내-광령 올레)',422),('루나폴',423),('롯데마트 제주점',424),('제주관광공사 지정면세점',425),('애월카페거리',426),('아쿠아플라넷 제주',427),('넥슨컴퓨터박물관',428),('올레길 17코스(광령-제주원도심 올레)',429),('한라산1100고지',430),('닭머르',431),('귤귤스토어',432),('올레야시장',433),('새연교',434),('훈데르트바서파크',435),('제주곶자왈도립공원',436),('마라도',437),('한담해안산책로',438),('비밀의숲',439),('올레길 21코스',440),('신창풍차해안도로',441),('용머리해안',442),('방주교회',443),('하고수동해변',444),('신창풍차해안',445),('문화예술 공공수장고',446),('걸어가는늑대들 전이수갤러리',447),('기당미술관',448),('올레길 19코스(조천-김녕 올레)',449),('올레길 5코스(남원-쇠소깍 올레)',450),('휘닉스제주 유민미술관',451),('신화관 제주신화월드 스카이풀',452),('윈드1947카트테마파크',453),('천아계곡',454),('올레길 4코스(표선-남원 올레)',455),('사계해변',456),('작가의산책길',457),('목장카페 밭디',458),('안돌오름',459),('제주제트 중문점',460),('남원큰엉해변',461),('한담몰',462),('외돌개 전망대',463),('싱계물공원',464),('코난해변',465),('탑동광장',466),('신화워터파크',467),('이마트 신제주점',468),('이승이오름',469),('빛의 벙커',470),('애월해안도로',471),('올레길 1코스(시흥-광치기 올레)',472),('세기알해변',473),('한담해변',474),('홈플러스 서귀포점',475),('어음리억새군락지',476),('한라산국립공원 성판악탐방로',477),('범섬',478),('가파도',479),('우도산호해변',480),('상가리야자숲',481),('닭머르해안길 1코스',482),('김서프제주',483),('이마트 제주점',484),('레몬뮤지엄',485),('창꼼',486),('다랑쉬오름',487),('용담해안도로',488),('우도올레보트',489),('큰엉',490),('유채꽃프라자',491),('신세계사이먼 제주프리미엄전문점',492),('논짓물해변',493),('아부오름',494),('소길별하',495),('마노르블랑',496),('제주돌문화공원',497),('안덕계곡',498),('서귀포자연휴양림',499),('올레길 10코스(화순-모슬포 올레)',500),('서부농업기술센터',501),('제주국제공항 JDC면세점',502),('황우지해안',503),('백록담',504),('우도정원',505),('송당무끈모루',506),('영주산',507),('사진놀이터',508),('제주월드컵경기장',509),('올레길 8코스(월평-대평 올레)',510),('관덕정',511),('하효쇠소깍해변',512),('거린사슴 전망대',513),('삼성혈',514),('칠성로쇼핑거리',515),('쉬리의언덕',516),('태웃개',517),('제주중문관광단지',518),('올레길 15-B코스(한림-고내 올레)',519),('제주조천스위스마을',520),('노을해안1014',521),('수산한못',522),('도구리알',523),('오저여',524),('알뜨르비행장',525),('제주문화예술진흥원 제주문예회관',526),('용연계곡',527),('디앤디파트먼트 제주',528),('한라산영실',529),('송악산',530),('우도봉 입구',531),('서우봉',532),('서빈백사',533),('사려니숲길',534),('수월봉',535),('사라봉공원',536);
/*!40000 ALTER TABLE `poi_source_map` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-10-01 14:52:18
